---
title: EffectInstance
classe: Autodesk.Revit.DB.DirectContext3D.EffectInstance
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# EffectInstance

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `effectInstance.IsValidObject` | Boolean |
| `Void Dispose()` | `effectInstance.Dispose()` | Void |
| `Boolean IsValid()` | `effectInstance.IsValid()` | Boolean |
| `Boolean MatchesFormat(VertexFormat)` | `effectInstance.MatchesFormat(vertexFormat)` | Boolean |
| `Void SetAmbientColor(Color)` | `effectInstance.SetAmbientColor(color)` | Void |
| `Void SetColor(Color)` | `effectInstance.SetColor(color)` | Void |
| `Void SetDiffuseColor(Color)` | `effectInstance.SetDiffuseColor(color)` | Void |
| `Void SetEmissiveColor(Color)` | `effectInstance.SetEmissiveColor(color)` | Void |
| `Void SetGlossiness(Double)` | `effectInstance.SetGlossiness(glossiness)` | Void |
| `Void SetSpecularColor(Color)` | `effectInstance.SetSpecularColor(color)` | Void |
| `Void SetTransparency(Double)` | `effectInstance.SetTransparency(transparency)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```